In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(columns=["Name", "Height", "Age"])

In [3]:
df

Empty DataFrame
Columns: [Name, Height, Age]
Index: []

In [4]:
df.loc[0] = ["Allen", 175, 25]
df

    Name  Height  Age
0  Allen     175   25

In [5]:
df["Weight"] = [75]

In [6]:
df

    Name  Height  Age  Weight
0  Allen     175   25      75

In [7]:
df.drop("Weight", axis=1)

    Name  Height  Age
0  Allen     175   25

In [8]:
df

    Name  Height  Age  Weight
0  Allen     175   25      75

In [9]:
df = df.drop("Weight", axis=1)
df

    Name  Height  Age
0  Allen     175   25

In [10]:
df.drop(0)

Empty DataFrame
Columns: [Name, Height, Age]
Index: []

In [11]:
df

    Name  Height  Age
0  Allen     175   25

In [12]:
df = df.drop(0)

In [13]:
df

Empty DataFrame
Columns: [Name, Height, Age]
Index: []

In [14]:
data = [
    ["Allen", 175, 75],
    ["Ted", 180, 85],
    ["Jack", 188, 77],
]
columns = ["Name", "Height", "Age"]

df = pd.DataFrame(
    data=data,
    columns=columns,
)

df

    Name  Height  Age
0  Allen     175   75
1    Ted     180   85
2   Jack     188   77

In [15]:
df["Age"]

0    75
1    85
2    77
Name: Age, dtype: int64

In [16]:
df["Age"][0] = 30
df

/tmp/ipykernel_33222/2990639814.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Age"][0] = 30

    Name  Height  Age
0  Allen     175   30
1    Ted     180   85
2   Jack     188   77

In [17]:
data = [
    ["Lucy", 175, 75],
    ["Trump", 180, 85],
    ["Rose", 188, 77],
]
columns = ["Name", "Height", "Age"]

df2 = pd.DataFrame(
    data=data,
    columns=columns,
)

df2

    Name  Height  Age
0   Lucy     175   75
1  Trump     180   85
2   Rose     188   77

In [18]:
pd.concat([df, df2])

    Name  Height  Age
0  Allen     175   30
1    Ted     180   85
2   Jack     188   77
0   Lucy     175   75
1  Trump     180   85
2   Rose     188   77

In [19]:
df3 = pd.concat([df, df2])
df3

    Name  Height  Age
0  Allen     175   30
1    Ted     180   85
2   Jack     188   77
0   Lucy     175   75
1  Trump     180   85
2   Rose     188   77

In [20]:
df3 = df3.reset_index(drop=True)
df3

    Name  Height  Age
0  Allen     175   30
1    Ted     180   85
2   Jack     188   77
3   Lucy     175   75
4  Trump     180   85
5   Rose     188   77

In [21]:
df["Height"]

0    175
1    180
2    188
Name: Height, dtype: int64

In [22]:
df.loc[0]

Name      Allen
Height      175
Age          30
Name: 0, dtype: object

In [23]:
df

    Name  Height  Age
0  Allen     175   30
1    Ted     180   85
2   Jack     188   77

In [24]:
df2

    Name  Height  Age
0   Lucy     175   75
1  Trump     180   85
2   Rose     188   77

In [25]:
df_back = df

In [27]:
df["Age"][0] = 55
df

/tmp/ipykernel_33222/2883244231.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Age"][0] = 55

    Name  Height  Age
0  Allen     175   55
1    Ted     180   85
2   Jack     188   77

In [28]:
df_back

    Name  Height  Age
0  Allen     175   55
1    Ted     180   85
2   Jack     188   77

In [29]:
df_back = df.copy()

In [30]:
df

    Name  Height  Age
0  Allen     175   55
1    Ted     180   85
2   Jack     188   77

In [31]:
df_back

    Name  Height  Age
0  Allen     175   55
1    Ted     180   85
2   Jack     188   77

In [32]:
df["Age"][0] = 30
df

/tmp/ipykernel_33222/2990639814.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df["Age"][0] = 30
/tmp/ipykernel_33222/2990639814.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Age"][0] = 30

    Name  Height  Age
0  Allen     175   30
1    Ted     180   85
2   Jack     188   77

In [33]:
df_back

    Name  Height  Age
0  Allen     175   55
1    Ted     180   85
2   Jack     188   77